EDT/УТ/src/Reports/Enter_3_Статусы/Enter_3_Статусы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>Enter_3_Статусы</name>
</mdclass:Report>

EDT/УТ/src/InformationRegisters/СтатусыЗаказов/СтатусыЗаказов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтатусыЗаказов</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <attributes>
    <name>СтатусAxiomus</name>
    <type>
      <types>CatalogRef.СтатусыAxiomus</types>
    </type>
  </attributes>
  <dimensions>
    <name>Заказ</name>
    <type>
      <types>DocumentRef.ЗаборТовара</types>
      <types>DocumentRef.Фрахт</types>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Статус</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ДокументРегистратор</name>
    <type>
      <types>DocumentRef</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Терминал</name>
    <type>
      <types>CatalogRef.РегиональныеТерминалы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПредварительноеЗакрытие</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Инициатор</name>
    <type>
      <types>EnumRef.ИнициаторыСостояния</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/УТ/src/Documents/ДанныеЗаказаВодителя/ДанныеЗаказаВодителя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ДанныеЗаказаВодителя</name>
  <registerRecords>InformationRegister.ОперативныеСтатусыЗаказовПоДаннымМП</registerRecords>
  <attributes>
    <name>УзелОбмена</name>
    <type>
      <types>ExchangePlanRef.ИзмененияДляМП</types>
    </type>
  </attributes>
  <attributes>
    <name>Реализация</name>
    <type>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
    </type>
  </attributes>
  <attributes>
    <name>Водитель</name>
    <type>
      <types>CatalogRef.новаВодители</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>CatalogRef.новаРезультатМестнойДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаНеВыполненияДоставки</name>
    <type>
      <types>CatalogRef.ПричиныНеВыполненияДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаОтказаПереноса</name>
    <type>
      <types>CatalogRef.ПричиныОтказаПереноса</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПереноса</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Транспорт</name>
    <type>
      <types>CatalogRef.новаТранспорт</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДоставки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипОплаты</name>
    <type>
      <types>CatalogRef.ТипыОплат</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЗаказа</name>
    <type>
      <types>EnumRef.ТипыЗаказов</types>
    </type>
  </attributes>
  <attributes>
    <name>Забор</name>
    <type>
      <types>DocumentRef.ЗаборТовара</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоМест</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбъемныйБрейк</name>
    <type>
      <types>CatalogRef.ОбъемныеБрейки</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПалет</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидПодъема</name>
    <type>
      <types>EnumRef.ВидыПодъемовВодителя</types>
    </type>
  </attributes>
  <attributes>
    <name>Этаж</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПовторовЗапросаСостоянияЧека</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтправкиЧекаНаПечать</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПечатиЧеков</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторЧека</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>11</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОшибкаФормированияЧекаНаСервере</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>EmailКлиента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторВозвратногоЧека</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>11</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипОплатыЧек</name>
    <type>
      <types>CatalogRef.ТипыОплат</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоХодокНаЭтаж</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РассчитаннаяСтоимостьПодъема</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВнесеннаяСтоимостьПодъема</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВесРасчетаПодъема</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БрейкРасчетаПодъема</name>
    <type>
      <types>CatalogRef.ВесовыеБрейкиРасчетаСтоимостиПодъемов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВесРасчетаПодъемаВыгруженный</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Рейс</name>
    <type>
      <types>DocumentRef.Рейс</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВыгрузки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ИнициаторСостояния</name>
    <type>
      <types>EnumRef.ИнициаторыСостояния</types>
    </type>
  </attributes>
  <attributes>
    <name>КодИдентификацииКлиента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатусУстановленБезКИК</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусОтИМ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РасчетнаяСтоимостьДоставки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОплаченаСтоимостьДоставкиПриОтменеЗаказа</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьДоставки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВерсияМП</name>
    <type>
      <types>CatalogRef.НомераВерсийМП</types>
    </type>
  </attributes>
  <attributes>
    <name>БылаПримерка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоSKUПримерки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВозвратНаДоставку</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДоставленныеТовары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоДоставлено</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КодМаркировки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ШтрихкодНоменклатуры</name>
      <type>
        <types>CatalogRef.ШтрихкодыТоваров</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОтказныеЭкземплярыТоваров</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Штрихкод</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

EDT/УТ/src/Reports/Enter_3_Статусы/ObjectModule.bsl
Функция Сформировать(Таб, НачПериода, КонПериода, Контрагент) Экспорт
	Таб.Очистить();
	Зап = Новый Запрос;
	Зап.Текст = "ВЫБРАТЬ
	            |	МАКСИМУМ(ДанныеЗаказаВодителя.Дата) КАК ДатаДоставки,
	            |	ДанныеЗаказаВодителя.Реализация
	            |ПОМЕСТИТЬ ВТВремяДоставки
	            |ИЗ
	            |	Документ.ДанныеЗаказаВодителя КАК ДанныеЗаказаВодителя
	            |ГДЕ
	            |	ДанныеЗаказаВодителя.Реализация.ВладелецТовара = &ИнтернетМагазин
	            |
	            |СГРУППИРОВАТЬ ПО
	            |	ДанныеЗаказаВодителя.Реализация
	            |;
	            |
	            |////////////////////////////////////////////////////////////////////////////////
	            |ВЫБРАТЬ
	            |	СтатусыЗаказов.Заказ,
	            |	МАКСИМУМ(СтатусыЗаказов.ДокументРегистратор) КАК ДокументРегистратор
	            |ПОМЕСТИТЬ ВТСтатусы
	            |ИЗ
	            |	РегистрСведений.СтатусыЗаказов КАК СтатусыЗаказов
	            |ГДЕ
	            |	СтатусыЗаказов.Статус В (231, 232, 235)
	            |	И СтатусыЗаказов.Период МЕЖДУ &НачПериода И &КонПериода
	            |
	            |СГРУППИРОВАТЬ ПО
	            |	СтатусыЗаказов.Заказ
	            |;
	            |
	            |////////////////////////////////////////////////////////////////////////////////
	            |ВЫБРАТЬ
	            |	ДанныеЗаказаВодителя.Реализация,
	            |	МАКСИМУМ(ДанныеЗаказаВодителя.Ссылка) КАК Ссылка
	            |ПОМЕСТИТЬ ВТДЗВ
	            |ИЗ
	            |	Документ.ДанныеЗаказаВодителя КАК ДанныеЗаказаВодителя
	            |
	            |СГРУППИРОВАТЬ ПО
	            |	ДанныеЗаказаВодителя.Реализация
	            |;
	            |
	            |////////////////////////////////////////////////////////////////////////////////
	            |ВЫБРАТЬ
	            |	новаМестнаяДоставка.ВремяПрибытияС КАК ВремяПрибытияС,
	            |	новаМестнаяДоставка.ВремяПрибытияПо КАК ВремяПрибытияПо,
	            |	ВТВремяДоставки.ДатаДоставки КАК ДатаДоставкиПоФакту,
	            |	ВЫБОР
	            |		КОГДА СтатусыЗаказов.Статус = 235
	            |			ТОГДА ДанныеЗаказаВодителя.ПричинаОтказаПереноса
	            |		ИНАЧЕ """"
	            |	КОНЕЦ КАК ПричинаОтмены,
	            |	ВЫБОР
	            |		КОГДА СтатусыЗаказов.Статус = 232
	            |			ТОГДА ДанныеЗаказаВодителя.ПричинаОтказаПереноса
	            |		ИНАЧЕ """"
	            |	КОНЕЦ КАК ПричинаПереноса,
	            |	РеализацияТоваровУслуг.НомерВнешнегоЗаказа КАК НомерЗаказа,
	            |	ВЫБОР
	            |		КОГДА СтатусыЗаказов.Статус = 235
	            |				ИЛИ СтатусыЗаказов.Статус = 232
	            |			ТОГДА ВЫБОР
	            |					КОГДА СтатусыЗаказов.Статус = 232
	            |						ТОГДА ""Перенос""
	            |					ИНАЧЕ ""Отмена""
	            |				КОНЕЦ
	            |		ИНАЧЕ ""Доставлен""
	            |	КОНЕЦ КАК СтатусЗаказа,
	            |	РеализацияТоваровУслуг.Дата КАК ДатаДоставки,
	            |	ВЫБОР
	            |		КОГДА СтатусыЗаказов.Статус <> 231
	            |			ТОГДА ВЫБОР
	            |					КОГДА ДанныеЗаказаВодителя.ПричинаНеВыполненияДоставки В (ЗНАЧЕНИЕ(Справочник.ПричиныНевыполненияДоставки.ПереносСЗаездом), ЗНАЧЕНИЕ(Справочник.ПричиныНевыполненияДоставки.ОтказКлиентаСЗаездом))
	            |						ТОГДА ИСТИНА
	            |					ИНАЧЕ ЛОЖЬ
	            |				КОНЕЦ
	            |		ИНАЧЕ ИСТИНА
	            |	КОНЕЦ КАК Ездили,
	            |	ДанныеЗаказаВодителя.Дата
	            |ИЗ
	            |	ВТСтатусы КАК ВТСтатусы
	            |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	            |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ДанныеЗаказаВодителя КАК ДанныеЗаказаВодителя
	            |				ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТДЗВ КАК ВТДЗВ
	            |				ПО ДанныеЗаказаВодителя.Ссылка = ВТДЗВ.Ссылка.Ссылка
	            |			ПО РеализацияТоваровУслуг.Ссылка = ДанныеЗаказаВодителя.Реализация.Ссылка
	            |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ БизнесПроцесс.новаМестнаяДоставка КАК новаМестнаяДоставка
	            |			ПО РеализацияТоваровУслуг.Номер = новаМестнаяДоставка.Номер
	            |			ЛЕВОЕ СОЕДИНЕНИЕ ВТВремяДоставки КАК ВТВремяДоставки
	            |			ПО РеализацияТоваровУслуг.Ссылка = ВТВремяДоставки.Реализация.Ссылка
	            |		ПО ВТСтатусы.Заказ.Ссылка = РеализацияТоваровУслуг.Ссылка
	            |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыЗаказов КАК СтатусыЗаказов
	            |		ПО (ВЫРАЗИТЬ(ВТСтатусы.ДокументРегистратор КАК Документ.ДанныеЗаказаВодителя).Ссылка = ВЫРАЗИТЬ(СтатусыЗаказов.ДокументРегистратор КАК Документ.ДанныеЗаказаВодителя).Ссылка)
	            |ГДЕ
	            |	ДанныеЗаказаВодителя.Дата МЕЖДУ &НачПериода И &КонПериода
	            |	И РеализацияТоваровУслуг.ВладелецТовара = &ИнтернетМагазин
	            |
	            |СГРУППИРОВАТЬ ПО
	            |	новаМестнаяДоставка.ВремяПрибытияС,
	            |	РеализацияТоваровУслуг.НомерВнешнегоЗаказа,
	            |	ВТВремяДоставки.ДатаДоставки,
	            |	новаМестнаяДоставка.ВремяПрибытияПо,
	            |	РеализацияТоваровУслуг.Дата,
	            |	ДанныеЗаказаВодителя.Дата,
	            |	ВЫБОР
	            |		КОГДА СтатусыЗаказов.Статус = 235
	            |			ТОГДА ДанныеЗаказаВодителя.ПричинаОтказаПереноса
	            |		ИНАЧЕ """"
	            |	КОНЕЦ,
	            |	ВЫБОР
	            |		КОГДА СтатусыЗаказов.Статус = 235
	            |				ИЛИ СтатусыЗаказов.Статус = 232
	            |			ТОГДА ВЫБОР
	            |					КОГДА СтатусыЗаказов.Статус = 232
	            |						ТОГДА ""Перенос""
	            |					ИНАЧЕ ""Отмена""
	            |				КОНЕЦ
	            |		ИНАЧЕ ""Доставлен""
	            |	КОНЕЦ,
	            |	ВЫБОР
	            |		КОГДА СтатусыЗаказов.Статус = 232
	            |			ТОГДА ДанныеЗаказаВодителя.ПричинаОтказаПереноса
	            |		ИНАЧЕ """"
	            |	КОНЕЦ,
	            |	ВЫБОР
	            |		КОГДА СтатусыЗаказов.Статус <> 231
	            |			ТОГДА ВЫБОР
	            |					КОГДА ДанныеЗаказаВодителя.ПричинаНеВыполненияДоставки В (ЗНАЧЕНИЕ(Справочник.ПричиныНевыполненияДоставки.ПереносСЗаездом), ЗНАЧЕНИЕ(Справочник.ПричиныНевыполненияДоставки.ОтказКлиентаСЗаездом))
	            |						ТОГДА ИСТИНА
	            |					ИНАЧЕ ЛОЖЬ
	            |				КОНЕЦ
	            |		ИНАЧЕ ИСТИНА
	            |	КОНЕЦ
	            |
	            |УПОРЯДОЧИТЬ ПО
	            |	ДанныеЗаказаВодителя.Дата
	            |;
	            |
	            |////////////////////////////////////////////////////////////////////////////////
	            |УНИЧТОЖИТЬ ВТВремяДоставки
	            |;
	            |
	            |////////////////////////////////////////////////////////////////////////////////
	            |УНИЧТОЖИТЬ ВТСтатусы";
				
				
				
				
	Зап.УстановитьПараметр("НачПериода", НачалоДня(НачПериода));			
	Зап.УстановитьПараметр("КонПериода", КонецДня(КонПериода));			
	Зап.УстановитьПараметр("ИнтернетМагазин", Контрагент);			
	
	Рез = Зап.Выполнить().Выгрузить();
	
	
	Мак = ПолучитьМакет("Макет");
	ОблШ = Мак.ПолучитьОбласть("Шапка");
	ОблСтр = Мак.ПолучитьОбласть("Строка");
	Таб.Вывести(ОблШ);
	
	
	
	
	Для Каждого Тек Из Рез Цикл
		ЗаполнитьЗначенияСвойств(ОблСтр.параметры, Тек);
		
		ЧН = Час(Тек.ВремяПрибытияС);
		ЧК = Час(Тек.ВремяПрибытияПо);
		
		ЧС = Окр(ЧК-ЧН/2);
		
		МН = Минута(Тек.ВремяПрибытияС);
		МК = Минута(Тек.ВремяПрибытияПо);
		
		ОблСтр.Параметры.ПериодДоставки = "с " + Формат(ЧН, "ЧЦ=2; ЧН=00; ЧВН=; ЧГ=") + ":" + Формат(МН, "ЧЦ=2; ЧН=00; ЧВН=; ЧГ=") + " по " + Формат(ЧК, "ЧЦ=2; ЧН=00; ЧВН=; ЧГ=") + ":" + Формат(МК, "ЧЦ=2; ЧН=00; ЧВН=; ЧГ=");
		
		Если ЗначениеЗаполнено(Тек.ДатаДоставкиПоФакту) Тогда
			ЧН = Час(Тек.ДатаДоставкиПоФакту);
			МН = Минута(Тек.ДатаДоставкиПоФакту);
			Если Тек.СтатусЗаказа = "Отмена" Тогда
				Если Тек.Ездили Тогда
					ОблСтр.Параметры.ВремяПриезда = Формат(ЧН, "ЧЦ=2; ЧВН=; ЧГ=") + ":" + Формат(МН, "ЧЦ=2; ЧН=00; ЧВН=; ЧГ=");
				Иначе
					ОблСтр.Параметры.ВремяПриезда = "не ездили";
				КонецеСли;	
			Иначе
				ОблСтр.Параметры.ВремяПриезда = Формат(ЧН, "ЧЦ=2; ЧВН=; ЧГ=") + ":" + Формат(МН, "ЧЦ=2; ЧН=00; ЧВН=; ЧГ=");
			КонецеСли;
		Иначе
			ОблСтр.Параметры.ВремяПриезда = Формат(ЧС, "ЧЦ=2; ЧВН=; ЧГ=") + ":23";
		КонецеСли;
		Таб.Вывести(ОблСтр);
	КонецЦикла;
	
	
	Таб.ПолеСлева = 3;
	Таб.ПолеСнизу = 3;
	Таб.ПолеСверху = 3;
	Таб.ПолеСправа = 3;
	Таб.Автомасштаб = Истина;
	Таб.ТолькоПросмотр = 1;
	Таб.ИмяПараметровПечати = "Энтер_2";
	Возврат Таб;
КонецФункции
